In [1]:
import pandas as pd
import numpy as np

In [33]:
data={'rank':[1,2,4,7,1,5,5,1],
     'marks':[100,99,89,70,100,65,65,99]}
df=pd.DataFrame(data)
df

   rank  marks
0     1    100
1     2     99
2     4     89
3     7     70
4     1    100
5     5     65
6     5     65
7     1     99

In [34]:
df[df.duplicated()]

   rank  marks
4     1    100
6     5     65

In [35]:
df.drop_duplicates(keep='first')

   rank  marks
0     1    100
1     2     99
2     4     89
3     7     70
5     5     65
7     1     99

In [36]:
df.drop_duplicates(keep=False)

   rank  marks
1     2     99
2     4     89
3     7     70
7     1     99

In [37]:
df.duplicated().sum()

2

In [38]:
df['rank'].unique()

array([1, 2, 4, 7, 5])

In [40]:
df.drop_duplicates('rank')

   rank  marks
0     1    100
1     2     99
2     4     89
3     7     70
5     5     65

In [41]:
c=[[35,5],[10,50]]
c

[[35, 5], [10, 50]]